app/controllers/items_controller.rb

SELECT * FROM `items` WHERE (`items`.`id` = 1 AND (`items`.product_id = 1))
---
  def show
    @item = @product.items.find(params[:id])

SELECT * FROM `product_attributes` WHERE (`product_attributes`.product_id = 1)
---
  def new
    @item = @product.items.new
    @product.product_attributes.each do |product_attribute|

INSERT INTO `items` (`name`, `created_at`, `avatar_file_name`, `avatar_file_size`, `product_id`, `updated_at`, `avatar_content_size`, `is_active`, `avatar_updated_at`) VALUES('ss', '2010-01-19 14:11:47', NULL, NULL, 1, '2010-01-19 14:11:47', NULL, NULL, NULL)
INSERT INTO `item_attributes` (`name`, `created_at`, `product_attribute_id`, `updated_at`, `value`, `item_id`) VALUES('test1', '2010-01-19 13:01:17', 5, '2010-01-19 13:01:17', 'ds', 13)
---
  def create
    @item = @product.items.new(params[:item])
    if @item.save
      @item.create_update_item_attributes(params[:item][:item_attributes])

SELECT * FROM `items` WHERE (`items`.`id` = 1 AND (`items`.product_id = 1))
SELECT * FROM `item_attributes` WHERE (`item_attributes`.item_id = 2) LIMIT 1
SELECT * FROM `product_attributes` WHERE (`product_attributes`.product_id = 3)
SELECT * FROM `products` WHERE (`products`.`id` = 1)
---
  def edit
    @item = @product.items.find(params[:id])
     @product.product_attributes.each do |product_attribute|

SELECT * FROM `items` WHERE (`items`.`id` = 14 AND (`items`.product_id = 1))
UPDATE `item_attributes` SET `updated_at` = '2010-01-19 13:50:07', `value` = '--- \n- bluetooth\n- bluetooth1\n' WHERE `id` = 34
UPDATE `items` SET `updated_at` = '2010-01-24 06:44:43', `avatar_file_size` = 5756, `avatar_file_name` = 'testimg.jpg', `avatar_updated_at` = '2010-01-24 06:44:42' WHERE `id` = 1
INSERT INTO `item_attributes` (`name`, `created_at`, `product_attribute_id`, `updated_at`, `value`, `item_id`) VALUES('abc', '2010-05-01 15:36:49', 17, '2010-05-01 15:36:49', NULL, 2)
---
  def update
    @item = @product.items.find(params[:id])
    if @item.update_attributes(params[:item])
       @item.create_update_item_attributes(params[:item][:item_attributes])

SELECT * FROM `items` WHERE (`items`.`id` = 1 AND (`items`.product_id = 1))
DELETE FROM `items` WHERE `id` = 1
---
  def destroy
    @item = @product.items.find(params[:id])
    @item.destroy

SELECT * FROM `products` WHERE (`products`.`id` = 1)
---
  def load_product
    @product = Product.find(params[:product_id])