app/controllers/products_controller.rb

SELECT * FROM `products` WHERE (products.name LIKE '%mob%')
---
  def index
    if params[:search].blank?
      @products = Product.all

INSERT INTO `products` (`name`, `created_at`, `updated_at`) VALUES('Mobile', '2010-01-19 09:46:04', '2010-01-19 09:46:04')
---
  def create
    @product = Product.new(params[:product])
    if @product.save

SELECT * FROM `products` WHERE (`products`.`id` = 1)
---
  def update
    @product = Product.find(params[:id])

SELECT * FROM `products` WHERE (`products`.`id` = 1)
DELETE FROM `products` WHERE `id` = 1
---
  def destroy
    @product = Product.find(params[:id])
    @product.destroy