app/controllers/product_attributes_controller.rb

  def show
    @product_attribute = @product.product_attributes.find(params[:id])
---
SELECT * FROM `product_attributes` WHERE (`product_attributes`.`id` = 2 AND (`product_attributes`.product_id = 1))
SELECT * FROM `products` WHERE (`products`.`id` = 1)

  def create
    @product_attribute = @product.product_attributes.new(params[:product_attribute])
    if @product_attribute.save
---
INSERT INTO `product_attributes` (`name`, `option`, `created_at`, `product_id`, `updated_at`, `is_searchable`, `option_type`) VALUES('price', '', '2010-01-24 09:16:52', 1, '2010-01-24 09:16:52', 1, 'text')

  def edit
    @product_attribute = @product.product_attributes.find(params[:id])
---
SELECT * FROM `product_attributes` WHERE (`product_attributes`.`id` = 6 AND (`product_attributes`.product_id = 1))
SELECT * FROM `products` WHERE (`products`.`id` = 1)

  def destroy
    @product_attribute = @product.product_attributes.find(params[:id])
    @product_attribute.destroy
---
SELECT * FROM `product_attributes` WHERE (`product_attributes`.`id` = 1 AND (`product_attributes`.product_id = 1))
SELECT * FROM `products` WHERE (`products`.`id` = 1)
DELETE FROM `product_attributes` WHERE `id` = 1

  def load_product
    @product = Product.find(params[:product_id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 1)